In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
from numpy.random import randn

In [2]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],index=['q','r','s','t','u','v'])

In [3]:
ser1

q    2.0
r    NaN
s    4.0
t    NaN
u    6.0
v    NaN
dtype: float64

In [5]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,
             index = ['q','r','s','t','u','v'])

In [6]:
# np.where conditional series

Series(np.where(pd.isnull(ser1),ser2,ser1),index = ser1.index)

q    2.0
r    1.0
s    4.0
t    3.0
u    6.0
v    5.0
dtype: float64

In [7]:
# short cut -- COMBINE

ser1.combine_first(ser2)

q    2.0
r    1.0
s    4.0
t    3.0
u    6.0
v    5.0
dtype: float64

In [10]:
# Combine with dataframes

nan = np.nan

dframe_odds = DataFrame({'x':[1.,nan,3.,nan],
                         'y':[nan,5.,nan,7.],
                         'z':[nan,9.,nan,11.]})

In [11]:
dframe_evens = DataFrame({'x':[2.,4.,nan, 6.,8.],
                          'y': [nan, 10.,12.,14.,16.]})

In [12]:
dframe_evens

     x     y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [13]:
dframe_odds

     x    y     z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [14]:
dframe_odds.combine_first(dframe_evens) #wherever dframe_odds has a nan, it will take the corresponding
                                        # value from dframe_evens

     x     y     z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN